load-tests/jmeter/nighthunt-stress-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <!-- ══════════════════════════════════════════════════════════════════
         NightHunt Backend Stress Test
         Scenarios: 500 VU / 1000 VU / 2000 VU
         Run:  jmeter -n -t nighthunt-stress-test.jmx
                      -Jvusers=500 -Jrampup=30 -Jduration=60
                      -Jusername=testuser -Jpassword=Test@123
                      -l results/scenario-500vu.jtl
                      -e -o reports/scenario-500vu/
         ══════════════════════════════════════════════════════════════════ -->
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
              testname="NightHunt Backend Stress Test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <!-- ── User-Defined Variables (override with -J flags on CLI) ── -->
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"
                   guiclass="ArgumentsPanel" testclass="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">vawnwuyest.me</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">443</stringProp>
          </elementProp>
          <elementProp name="PROTOCOL" elementType="Argument">
            <stringProp name="Argument.name">PROTOCOL</stringProp>
            <stringProp name="Argument.value">https</stringProp>
          </elementProp>
          <!-- Override these via -Jusername / -Jpassword on CLI -->
          <elementProp name="USERNAME" elementType="Argument">
            <stringProp name="Argument.name">USERNAME</stringProp>
            <stringProp name="Argument.value">${__P(username,testuser1)}</stringProp>
          </elementProp>
          <elementProp name="PASSWORD" elementType="Argument">
            <stringProp name="Argument.name">PASSWORD</stringProp>
            <stringProp name="Argument.value">${__P(password,Test@123456)}</stringProp>
          </elementProp>
          <!-- Load scenario params (override with -J flags) -->
          <elementProp name="VU_COUNT" elementType="Argument">
            <stringProp name="Argument.name">VU_COUNT</stringProp>
            <stringProp name="Argument.value">${__P(vusers,500)}</stringProp>
          </elementProp>
          <elementProp name="RAMP_UP" elementType="Argument">
            <stringProp name="Argument.name">RAMP_UP</stringProp>
            <stringProp name="Argument.value">${__P(rampup,30)}</stringProp>
          </elementProp>
          <elementProp name="DURATION" elementType="Argument">
            <stringProp name="Argument.name">DURATION</stringProp>
            <stringProp name="Argument.value">${__P(duration,60)}</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ══════════════════════════════════════════════════════════════════
           1. SETUP: Login once → extract JWT → store as JMeter property
           ══════════════════════════════════════════════════════════════════ -->
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup"
                        testname="[Setup] Login and Get JWT Token" enabled="true">
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
      </SetupThreadGroup>
      <hashTree>
        <!-- HTTP Request Defaults for setup -->
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement"
                           testname="HTTP Defaults (Setup)" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">15000</stringProp>
        </ConfigTestElement>
        <hashTree/>

        <!-- Login Request -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="POST /api/auth/login" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"username":"${USERNAME}","password":"${PASSWORD}"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/auth/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Content-Type header -->
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                         testname="Content-Type JSON" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>

          <!-- Extract JWT from response: {"data":{"accessToken":"..."}} -->
          <JSONPathExtractor guiclass="JSONPathExtractorGui" testclass="JSONPathExtractor"
                             testname="Extract JWT Token" enabled="true">
            <stringProp name="JSONPathExtractor.referenceName">JWT_TOKEN</stringProp>
            <stringProp name="JSONPathExtractor.jsonPathExprs">$.data.accessToken</stringProp>
            <stringProp name="JSONPathExtractor.defaultValues">TOKEN_NOT_FOUND</stringProp>
            <stringProp name="JSONPathExtractor.match_no">0</stringProp>
          </JSONPathExtractor>
          <hashTree/>

          <!-- Store token as JMeter property (accessible to all thread groups) -->
          <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor"
                                  testname="Store Token as Property" enabled="true">
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="script">
String token = vars.get("JWT_TOKEN");
if (token != null &amp;&amp; !token.equals("TOKEN_NOT_FOUND")) {
    props.put("jwt_token", token);
    log.info("JWT Token stored: " + token.substring(0, Math.min(20, token.length())) + "...");
} else {
    log.error("LOGIN FAILED — check credentials! Response: " + prev.getResponseDataAsString());
}
            </stringProp>
          </BeanShellPostProcessor>
          <hashTree/>

          <!-- Assert login succeeded -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert Login 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- ══════════════════════════════════════════════════════════════════
           2. MAIN THREAD GROUP — parameterized by -Jvusers, -Jrampup, -Jduration
           ══════════════════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="[Main] Concurrent Users — ${VU_COUNT} VU" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${VU_COUNT}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMP_UP}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${DURATION}</stringProp>
        <stringProp name="ThreadGroup.delay">2</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>

        <!-- HTTP Defaults for main tests -->
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement"
                           testname="HTTP Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
          <boolProp name="HTTPSampler.image_parser">false</boolProp>
        </ConfigTestElement>
        <hashTree/>

        <!-- Authorization Header (shared JWT from setUp) -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                       testname="Authorization Header" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${__property(jwt_token)}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- HTTP Cache Manager (disable caching for accurate results) -->
        <CacheManager guiclass="CacheManagerGui" testclass="CacheManager"
                      testname="HTTP Cache Manager" enabled="true">
          <boolProp name="clearEachIteration">true</boolProp>
          <boolProp name="useExpires">false</boolProp>
        </CacheManager>
        <hashTree/>

        <!-- ── Transaction 1: Check Session (40% weight — simulate active players) ─ -->
        <TransactionController guiclass="TransactionControllerGui"
                               testclass="TransactionController"
                               testname="T1: Check Session" enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
        </TransactionController>
        <hashTree>
          <ThroughputController guiclass="ThroughputControllerGui"
                                testclass="ThroughputController"
                                testname="40% weight" enabled="true">
            <intProp name="ThroughputController.style">1</intProp>
            <boolProp name="ThroughputController.perThread">false</boolProp>
            <floatProp name="ThroughputController.percentThroughput">40.0</floatProp>
          </ThroughputController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                              testname="GET /api/auth/check-session" enabled="true">
              <stringProp name="HTTPSampler.path">/api/auth/check-session</stringProp>
              <stringProp name="HTTPSampler.method">GET</stringProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            </HTTPSamplerProxy>
            <hashTree>
              <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                                 testname="Assert 2xx" enabled="true">
                <collectionProp name="Asserion.test_strings">
                  <stringProp name="49586">2\d\d</stringProp>
                </collectionProp>
                <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                <boolProp name="Assertion.assume_success">false</boolProp>
                <intProp name="Assertion.test_type">1</intProp>
              </ResponseAssertion>
              <hashTree/>
            </hashTree>
          </hashTree>
        </hashTree>

        <!-- ── Transaction 2: Backend Stats (30% weight — dashboard/lobby polling) ─ -->
        <TransactionController guiclass="TransactionControllerGui"
                               testclass="TransactionController"
                               testname="T2: Backend Stats" enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
        </TransactionController>
        <hashTree>
          <ThroughputController guiclass="ThroughputControllerGui"
                                testclass="ThroughputController"
                                testname="30% weight" enabled="true">
            <intProp name="ThroughputController.style">1</intProp>
            <boolProp name="ThroughputController.perThread">false</boolProp>
            <floatProp name="ThroughputController.percentThroughput">30.0</floatProp>
          </ThroughputController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                              testname="GET /api/backend/stats" enabled="true">
              <stringProp name="HTTPSampler.path">/api/backend/stats</stringProp>
              <stringProp name="HTTPSampler.method">GET</stringProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            </HTTPSamplerProxy>
            <hashTree>
              <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                                 testname="Assert 2xx" enabled="true">
                <collectionProp name="Asserion.test_strings">
                  <stringProp name="49586">2\d\d</stringProp>
                </collectionProp>
                <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                <boolProp name="Assertion.assume_success">false</boolProp>
                <intProp name="Assertion.test_type">1</intProp>
              </ResponseAssertion>
              <hashTree/>
            </hashTree>
          </hashTree>
        </hashTree>

        <!-- ── Transaction 3: Game Modes Available (20% weight — lobby screen) ─── -->
        <TransactionController guiclass="TransactionControllerGui"
                               testclass="TransactionController"
                               testname="T3: Game Modes" enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
        </TransactionController>
        <hashTree>
          <ThroughputController guiclass="ThroughputControllerGui"
                                testclass="ThroughputController"
                                testname="20% weight" enabled="true">
            <intProp name="ThroughputController.style">1</intProp>
            <boolProp name="ThroughputController.perThread">false</boolProp>
            <floatProp name="ThroughputController.percentThroughput">20.0</floatProp>
          </ThroughputController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                              testname="GET /api/game-modes/available" enabled="true">
              <stringProp name="HTTPSampler.path">/api/game-modes/available</stringProp>
              <stringProp name="HTTPSampler.method">GET</stringProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            </HTTPSamplerProxy>
            <hashTree>
              <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                                 testname="Assert 2xx" enabled="true">
                <collectionProp name="Asserion.test_strings">
                  <stringProp name="49586">2\d\d</stringProp>
                </collectionProp>
                <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                <boolProp name="Assumption.assume_success">false</boolProp>
                <intProp name="Assertion.test_type">1</intProp>
              </ResponseAssertion>
              <hashTree/>
            </hashTree>
          </hashTree>
        </hashTree>

        <!-- ── Transaction 4: Match History (10% weight — DB read, heaviest) ────── -->
        <TransactionController guiclass="TransactionControllerGui"
                               testclass="TransactionController"
                               testname="T4: Match History (DB read)" enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
        </TransactionController>
        <hashTree>
          <ThroughputController guiclass="ThroughputControllerGui"
                                testclass="ThroughputController"
                                testname="10% weight" enabled="true">
            <intProp name="ThroughputController.style">1</intProp>
            <boolProp name="ThroughputController.perThread">false</boolProp>
            <floatProp name="ThroughputController.percentThroughput">10.0</floatProp>
          </ThroughputController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                              testname="GET /api/match/history?page=0&amp;size=10" enabled="true">
              <stringProp name="HTTPSampler.path">/api/match/history?page=0&amp;size=10</stringProp>
              <stringProp name="HTTPSampler.method">GET</stringProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            </HTTPSamplerProxy>
            <hashTree>
              <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                                 testname="Assert 2xx" enabled="true">
                <collectionProp name="Asserion.test_strings">
                  <stringProp name="49586">2\d\d</stringProp>
                </collectionProp>
                <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                <boolProp name="Assertion.assume_success">false</boolProp>
                <intProp name="Assertion.test_type">1</intProp>
              </ResponseAssertion>
              <hashTree/>
            </hashTree>
          </hashTree>
        </hashTree>

        <!-- Think time: 100-500ms random pause (simulate real user behavior) -->
        <GaussianRandomTimer guiclass="GaussianRandomTimerGui"
                             testclass="GaussianRandomTimer"
                             testname="Think Time (100-500ms)" enabled="true">
          <stringProp name="ConstantTimer.delay">100</stringProp>
          <stringProp name="RandomTimer.range">400</stringProp>
        </GaussianRandomTimer>
        <hashTree/>

        <!-- ── LISTENERS ─────────────────────────────────────────────────── -->

        <!-- Aggregate Report: shows Avg/Min/Max/p90/p95/p99/Throughput/Error% per endpoint -->
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector"
                         testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

        <!-- Summary Report: overall totals -->
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                         testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

        <!-- View Results Tree (disable in high-load runs, enable for debug) -->
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector"
                         testname="View Results Tree [DEBUG ONLY - disable for load test]"
                         enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

      </hashTree>
      <!-- END Main Thread Group -->

    </hashTree>
  </hashTree>
</jmeterTestPlan>